######################### pan #######################
layer {
  name: "remote_pan"
  type: "Data"
  top: "data_pan"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
#    mean_file: "examples/cifar10/mean.binaryproto"
#    mean_file: "examples/fusion2-cls2/2_branch/mean16_pan.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean16_new4ACOSS_pan.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean12_new4ACOSS_pan.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean24_new4ACOSS_pan.binaryproto"
     mean_file: "examples/fusion2-cls2/2_branch/meanall_new4ACOSS_pan.binaryproto"
#    scale: 0.00390625
#    scale: 1
  }
  data_param {
#   source: "examples/cifar10/cifar10_train_lmdb"
#    source: "examples/fusion2-cls2/trainlmdb16_pan"
#     source: "examples/fusion2-cls2/trainlmdb16_new4ACOSS_pan"
#     source: "examples/fusion2-cls2/trainlmdb12_new4ACOSS_pan"
#     source: "examples/fusion2-cls2/trainlmdb24_new4ACOSS_pan"
     source: "examples/fusion2-cls2/trainlmdball_new4ACOSS_pan"
    batch_size: 40
    backend: LMDB
  }
}

layer {
  name: "remote_pan"
  type: "Data"
  top: "data_pan"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
#    mean_file: "examples/cifar10/mean.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean16_pan.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean16_new4ACOSS_pan.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean12_new4ACOSS_pan.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean24_new4ACOSS_pan.binaryproto"
      mean_file: "examples/fusion2-cls2/2_branch/meanall_new4ACOSS_pan.binaryproto"
#    scale: 0.00390625
#    scale: 1
  }
  data_param {
#    source: "examples/cifar10/cifar10_test_lmdb"
#     source: "examples/fusion2-cls2/trainlmdb16_pan"
#     source: "examples/fusion2-cls2/trainlmdb16_new4ACOSS_pan"
#     source: "examples/fusion2-cls2/trainlmdb12_new4ACOSS_pan"
#     source: "examples/fusion2-cls2/trainlmdb24_new4ACOSS_pan"
     source: "examples/fusion2-cls2/trainlmdball_new4ACOSS_pan"
    batch_size: 40
    backend: LMDB
  }
}

######################### ms #######################
layer {
  name: "remote_ms"
  type: "Data"
  top: "data_ms"
#  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
#    mean_file: "examples/cifar10/mean.binaryproto"
#    mean_file: "examples/fusion2-cls2/2_branch/mean16_ms.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean16_new4ACOSS_ms.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean12_new4ACOSS_ms.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean24_new4ACOSS_ms.binaryproto"
     mean_file: "examples/fusion2-cls2/2_branch/meanall_new4ACOSS_ms.binaryproto"
#    scale: 0.00390625
#    scale: 1
  }
  data_param {
#   source: "examples/cifar10/cifar10_train_lmdb"
#    source: "examples/fusion2-cls2/trainlmdb16_ms"
#    source: "examples/fusion2-cls2/trainlmdb16_new4ACOSS_ms"
#    source: "examples/fusion2-cls2/trainlmdb12_new4ACOSS_ms"
#    source: "examples/fusion2-cls2/trainlmdb24_new4ACOSS_ms"
    source: "examples/fusion2-cls2/trainlmdball_new4ACOSS_ms"
    batch_size: 40
    backend: LMDB
  }
}

layer {
  name: "remote_ms"
  type: "Data"
  top: "data_ms"
#  top: "label"
  include {
    phase: TEST
  }
  transform_param {
#    mean_file: "examples/cifar10/mean.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean16_ms.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean16_new4ACOSS_ms.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean12_new4ACOSS_ms.binaryproto"
#     mean_file: "examples/fusion2-cls2/2_branch/mean24_new4ACOSS_ms.binaryproto"
     mean_file: "examples/fusion2-cls2/2_branch/meanall_new4ACOSS_ms.binaryproto"
#    scale: 0.00390625
#    scale: 1
  }
  data_param {
#    source: "examples/cifar10/cifar10_test_lmdb"
#     source: "examples/fusion2-cls2/trainlmdb16_ms"
#     source: "examples/fusion2-cls2/trainlmdb16_new4ACOSS_ms"
#     source: "examples/fusion2-cls2/trainlmdb12_new4ACOSS_ms"
#    source: "examples/fusion2-cls2/trainlmdb24_new4ACOSS_ms"
    source: "examples/fusion2-cls2/trainlmdball_new4ACOSS_ms"
    batch_size: 40
    backend: LMDB
  }
}

###########################pan/pre_res_0#####################################
layer {
  name: "conv1_pan"
  type: "Convolution"
  bottom: "data_pan"
  top: "conv1_pan"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv1_pan/bn"
  type: "BatchNorm"
  bottom: "conv1_pan"
  top: "conv1_pan"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "conv1_pan/scale"
  type: "Scale"
  bottom: "conv1_pan"
  top: "conv1_pan"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_pan/relu"
  type: "ReLU"
  bottom: "conv1_pan"
  top: "conv1_pan"
}
##########################pan/AttentionA_1/trunk/res1#####################################
layer{
	name: "pre_res_1/branch1/conv1_1x1"
	type: "Convolution"
	bottom: "conv1_pan"
	top: "pre_res_1/branch1/conv1_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
  name: "pre_res_1/branch1/conv1_1x1/bn"
  type: "BatchNorm"
  bottom: "pre_res_1/branch1/conv1_1x1"
  top: "pre_res_1/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "pre_res_1/branch1/conv1_1x1/scale"
  type: "Scale"
  bottom: "pre_res_1/branch1/conv1_1x1/bn"
  top: "pre_res_1/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "pre_res_1/branch1/conv1_1x1/relu"
	type: "ReLU"
	bottom: "pre_res_1/branch1/conv1_1x1/bn"
	top: "pre_res_1/branch1/conv1_1x1/bn"
}

layer{
	name: "pre_res_1/branch1/conv2_3x3"
	type: "Convolution"
	bottom: "pre_res_1/branch1/conv1_1x1/bn"
	top: "pre_res_1/branch1/conv2_3x3"
	convolution_param {
		num_output: 8
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "pre_res_1/branch1/conv2_3x3/bn"
	type: "BatchNorm"
	bottom: "pre_res_1/branch1/conv2_3x3"
	top: "pre_res_1/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "pre_res_1/branch1/conv2_3x3/scale"
  type: "Scale"
  bottom: "pre_res_1/branch1/conv2_3x3/bn"
  top: "pre_res_1/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "pre_res_1/branch1/conv2_3x3/relu"
	type: "ReLU"
	bottom: "pre_res_1/branch1/conv2_3x3/bn"
	top: "pre_res_1/branch1/conv2_3x3/bn"
}

layer{
	name: "pre_res_1/branch1/conv3_1x1"
	type: "Convolution"
	bottom: "pre_res_1/branch1/conv2_3x3/bn"
	top: "pre_res_1/branch1/conv3_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "pre_res_1/branch2/conv1_1x1"
	type: "Convolution"
	bottom: "conv1_pan"
	top: "pre_res_1/branch2/conv1_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "pre_res_1"
	type: "Eltwise"
	bottom: "pre_res_1/branch2/conv1_1x1"
	bottom: "pre_res_1/branch1/conv3_1x1"
	top: "pre_res_1"
	eltwise_param {
		operation: SUM
	}
}
#########################pan/AttentionA_1/mask/down_sample/pool2####################
layer{
	name: "AttentionA_1/mask/down_sample/pool2"
	type: "Pooling"
	bottom: "pre_res_1"
	top: "AttentionA_1/mask/down_sample/pool2"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	name: "AttentionA_1/mask/down_sample/pool2/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/down_sample/pool2"
	top: "AttentionA_1/mask/down_sample/pool2/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/down_sample/pool2/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/down_sample/pool2/bn"
  top: "AttentionA_1/mask/down_sample/pool2/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/down_sample/pool2/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/down_sample/pool2/bn"
	top: "AttentionA_1/mask/down_sample/pool2/bn"
}

layer{
	name: "AttentionA_1/mask/down_sample/pool2/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_1/mask/down_sample/pool2/bn"
	top: "AttentionA_1/mask/down_sample/pool2/conv1_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_1/mask/down_sample/pool2/conv1_1x1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/down_sample/pool2/conv1_1x1"
	top: "AttentionA_1/mask/down_sample/pool2/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/down_sample/pool2/conv1_1x1/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/down_sample/pool2/conv1_1x1/bn"
  top: "AttentionA_1/mask/down_sample/pool2/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/down_sample/pool2/conv1_1x1/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/down_sample/pool2/conv1_1x1/bn"
	top: "AttentionA_1/mask/down_sample/pool2/conv1_1x1/bn"
}

layer{
	name: "AttentionA_1/mask/down_sample/pool2/conv2_3x3"
	type: "Convolution"
	bottom: "AttentionA_1/mask/down_sample/pool2/conv1_1x1/bn"
	top: "AttentionA_1/mask/down_sample/pool2/conv2_3x3"
	convolution_param {
		num_output: 8
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_1/mask/down_sample/pool2/conv2_3x3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/down_sample/pool2/conv2_3x3"
	top: "AttentionA_1/mask/down_sample/pool2/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/down_sample/pool2/conv2_3x3/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/down_sample/pool2/conv2_3x3/bn"
  top: "AttentionA_1/mask/down_sample/pool2/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/down_sample/pool2/conv2_3x3/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/down_sample/pool2/conv2_3x3/bn"
	top: "AttentionA_1/mask/down_sample/pool2/conv2_3x3/bn"
}

layer{
	name: "AttentionA_1/mask/down_sample/pool2/conv3_1x1"
	type: "Convolution"
	bottom: "AttentionA_1/mask/down_sample/pool2/conv2_3x3/bn"
	top: "AttentionA_1/mask/down_sample/pool2/conv3_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_1/mask/down_sample/pool2/res2_1"
	type: "Eltwise"
	bottom: "AttentionA_1/mask/down_sample/pool2/conv3_1x1"
	bottom: "AttentionA_1/mask/down_sample/pool2"
	top: "AttentionA_1/mask/down_sample/pool2/res2_1"
	eltwise_param {
		operation: SUM
	}
}

###########################pan/AttentionA_1/mask/down_sample/pool3#############
layer{
	name: "AttentionA_1/mask/down_sample/pool3"
	type: "Pooling"
	bottom: "AttentionA_1/mask/down_sample/pool2/res2_1"
	top: "AttentionA_1/mask/down_sample/pool3"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	name: "AttentionA_1/mask/down_sample/pool3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/down_sample/pool3"
	top: "AttentionA_1/mask/down_sample/pool3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/down_sample/pool3/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/down_sample/pool3/bn"
  top: "AttentionA_1/mask/down_sample/pool3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/down_sample/pool3/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/down_sample/pool3/bn"
	top: "AttentionA_1/mask/down_sample/pool3/bn"
}

layer{
	name: "AttentionA_1/mask/down_sample/pool3/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_1/mask/down_sample/pool3/bn"
	top: "AttentionA_1/mask/down_sample/pool3/conv1_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_1/mask/down_sample/pool3/conv1_1x1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/down_sample/pool3/conv1_1x1"
	top: "AttentionA_1/mask/down_sample/pool3/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/down_sample/pool3/conv1_1x1/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/down_sample/pool3/conv1_1x1/bn"
  top: "AttentionA_1/mask/down_sample/pool3/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/down_sample/pool3/conv1_1x1/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/down_sample/pool3/conv1_1x1/bn"
	top: "AttentionA_1/mask/down_sample/pool3/conv1_1x1/bn"
}

layer{
	name: "AttentionA_1/mask/down_sample/pool3/conv2_3x3"
	type: "Convolution"
	bottom: "AttentionA_1/mask/down_sample/pool3/conv1_1x1/bn"
	top: "AttentionA_1/mask/down_sample/pool3/conv2_3x3"
	convolution_param {
		num_output: 8
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_1/mask/down_sample/pool3/conv2_3x3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/down_sample/pool3/conv2_3x3"
	top: "AttentionA_1/mask/down_sample/pool3/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/down_sample/pool3/conv2_3x3/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/down_sample/pool3/conv2_3x3/bn"
  top: "AttentionA_1/mask/down_sample/pool3/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/down_sample/pool3/conv2_3x3/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/down_sample/pool3/conv2_3x3/bn"
	top: "AttentionA_1/mask/down_sample/pool3/conv2_3x3/bn"
}

layer{
	name: "AttentionA_1/mask/down_sample/pool3/conv3_1x1"
	type: "Convolution"
	bottom: "AttentionA_1/mask/down_sample/pool3/conv2_3x3/bn"
	top: "AttentionA_1/mask/down_sample/pool3/conv3_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_1/mask/down_sample/pool3/res3_1"
	type: "Eltwise"
	bottom: "AttentionA_1/mask/down_sample/pool3/conv3_1x1"
	bottom: "AttentionA_1/mask/down_sample/pool3"
	top: "AttentionA_1/mask/down_sample/pool3/res3_1"
	eltwise_param {
		operation: SUM
	}
}

######################pan/AttentionA_1/mask/up_sample/interp2###########
layer{
	name: "AttentionA_1/mask/up_sample/interp2"
	type: "Interp"
	bottom: "AttentionA_1/mask/down_sample/pool3/res3_1"
	bottom: "AttentionA_1/mask/down_sample/pool2/res2_1"
	top: "AttentionA_1/mask/up_sample/interp2"
}

layer{
	name: "AttentionA_1/mask/up_sample/in2"
	type: "Eltwise"
	bottom: "AttentionA_1/mask/down_sample/pool2/res2_1"
	bottom: "AttentionA_1/mask/up_sample/interp2"
	top: "AttentionA_1/mask/up_sample/in2"
	eltwise_param {
		operation: SUM
	}
}

layer {
	name: "AttentionA_1/mask/up_sample/in2/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/up_sample/in2"
	top: "AttentionA_1/mask/up_sample/in2/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/up_sample/in2/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/up_sample/in2/bn"
  top: "AttentionA_1/mask/up_sample/in2/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/up_sample/in2/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/up_sample/in2/bn"
	top: "AttentionA_1/mask/up_sample/in2/bn"
}

layer{
	name: "AttentionA_1/mask/up_sample/in2/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_1/mask/up_sample/in2/bn"
	top: "AttentionA_1/mask/up_sample/in2/conv1_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_1/mask/up_sample/in2/conv1_1x1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/up_sample/in2/conv1_1x1"
	top: "AttentionA_1/mask/up_sample/in2/conv1_1x1/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/up_sample/in2/conv1_1x1/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/up_sample/in2/conv1_1x1/bn"
  top: "AttentionA_1/mask/up_sample/in2/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/up_sample/in2/conv1_1x1/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/up_sample/in2/conv1_1x1/bn"
	top: "AttentionA_1/mask/up_sample/in2/conv1_1x1/bn"
}

layer{
	name: "AttentionA_1/mask/up_sample/in2/conv2_3x3"
	type: "Convolution"
	bottom: "AttentionA_1/mask/up_sample/in2/conv1_1x1/bn"
	top: "AttentionA_1/mask/up_sample/in2/conv2_3x3"
	convolution_param {
		num_output: 8
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_1/mask/up_sample/in2/conv2_3x3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/up_sample/in2/conv2_3x3"
	top: "AttentionA_1/mask/up_sample/in2/conv2_3x3/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/up_sample/in2/conv2_3x3/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/up_sample/in2/conv2_3x3/bn"
  top: "AttentionA_1/mask/up_sample/in2/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/up_sample/in2/conv2_3x3/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/up_sample/in2/conv2_3x3/bn"
	top: "AttentionA_1/mask/up_sample/in2/conv2_3x3/bn"
}

layer{
	name: "AttentionA_1/mask/up_sample/in2/conv3_1x1"
	type: "Convolution"
	bottom: "AttentionA_1/mask/up_sample/in2/conv2_3x3/bn"
	top: "AttentionA_1/mask/up_sample/in2/conv3_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_1/mask/up_sample/in2/res2_1"
	type: "Eltwise"
	bottom: "AttentionA_1/mask/up_sample/in2/conv3_1x1"
	bottom: "AttentionA_1/mask/up_sample/in2"
	top: "AttentionA_1/mask/up_sample/in2/res2_1"
	eltwise_param {
		operation: SUM
	}
}
#############AttentionA_1/mask/up_sample/interp1###################

layer{
	name: "AttentionA_1/mask/up_sample/interp1"
	type: "Interp"
	bottom: "AttentionA_1/mask/up_sample/in2/res2_1"
	bottom: "pre_res_1"
	top: "AttentionA_1/mask/up_sample/interp1"
}

layer {
	name: "AttentionA_1/mask/up_sample/interp1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/up_sample/interp1"
	top: "AttentionA_1/mask/up_sample/interp1/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/up_sample/interp1/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/up_sample/interp1/bn"
  top: "AttentionA_1/mask/up_sample/interp1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/up_sample/interp1/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/up_sample/interp1/bn"
	top: "AttentionA_1/mask/up_sample/interp1/bn"
}

layer{
	name: "AttentionA_1/mask/linear_1"
	type: "Convolution"
	bottom: "AttentionA_1/mask/up_sample/interp1/bn"
	top: "AttentionA_1/mask/linear_1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_1/mask/linear_1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1/mask/linear_1"
	top: "AttentionA_1/mask/linear_1/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1/mask/linear_1/scale"
  type: "Scale"
  bottom: "AttentionA_1/mask/linear_1/bn"
  top: "AttentionA_1/mask/linear_1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1/mask/linear_1/relu"
	type: "ReLU"
	bottom: "AttentionA_1/mask/linear_1/bn"
	top: "AttentionA_1/mask/linear_1/bn"
}

layer{
	name: "AttentionA_1/mask/linear_2"
	type: "Convolution"
	bottom: "AttentionA_1/mask/linear_1/bn"
	top: "AttentionA_1/mask/linear_2"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_1/mask"
	type: "Sigmoid"
	bottom: "AttentionA_1/mask/linear_2"
	top: "AttentionA_1/mask"
}

layer{
	name: "AttentionA_1_prod"
	type: "Eltwise"
	bottom: "pre_res_1"
	bottom: "AttentionA_1/mask"
	top: "AttentionA_1_prod"
	eltwise_param {
		operation: PROD
	}
}

layer{
	name: "AttentionA_1_sum"
	type: "Eltwise"
	bottom: "pre_res_1"
	bottom: "AttentionA_1_prod"
	top: "AttentionA_1_sum"
	eltwise_param {
		operation: SUM
	}
}
###
layer {
	name: "AttentionA_1_sum/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1_sum"
	top: "AttentionA_1_sum/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1_sum/scale"
  type: "Scale"
  bottom: "AttentionA_1_sum/bn"
  top: "AttentionA_1_sum/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1_sum/relu"
	type: "ReLU"
	bottom: "AttentionA_1_sum/bn"
	top: "AttentionA_1_sum/bn"
}

layer{
	name: "AttentionA_1_sum/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_1_sum/bn"
	top: "AttentionA_1_sum/conv1_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_1_sum/conv1_1x1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1_sum/conv1_1x1"
	top: "AttentionA_1_sum/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1_sum/conv1_1x1/scale"
  type: "Scale"
  bottom: "AttentionA_1_sum/conv1_1x1/bn"
  top: "AttentionA_1_sum/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1_sum/conv1_1x1/relu"
	type: "ReLU"
	bottom: "AttentionA_1_sum/conv1_1x1/bn"
	top: "AttentionA_1_sum/conv1_1x1/bn"
}

layer{
	name: "AttentionA_1_sum/conv2_3x3"
	type: "Convolution"
	bottom: "AttentionA_1_sum/conv1_1x1/bn"
	top: "AttentionA_1_sum/conv2_3x3"
	convolution_param {
		num_output: 8
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_1_sum/conv2_3x3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_1_sum/conv2_3x3"
	top: "AttentionA_1_sum/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_1_sum/conv2_3x3/scale"
  type: "Scale"
  bottom: "AttentionA_1_sum/conv2_3x3/bn"
  top: "AttentionA_1_sum/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_1_sum/conv2_3x3/relu"
	type: "ReLU"
	bottom: "AttentionA_1_sum/conv2_3x3/bn"
	top: "AttentionA_1_sum/conv2_3x3/bn"
}

layer{
	name: "AttentionA_1_sum/conv3_1x1"
	type: "Convolution"
	bottom: "AttentionA_1_sum/conv2_3x3/bn"
	top: "AttentionA_1_sum/conv3_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_1_sum/res3_1"
	type: "Eltwise"
	bottom: "AttentionA_1_sum/conv3_1x1"
	bottom: "AttentionA_1_sum"
	top: "AttentionA_1_sum/res3_1"
	eltwise_param {
		operation: SUM
	}
}

###


################################pan/AttentionA_12####################
layer{
	name: "AttentionA_12/pool1"
	type: "Pooling"
	bottom: "AttentionA_1_sum/res3_1"
	top: "AttentionA_12/pool1"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	name: "AttentionA_12/pool1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_12/pool1"
	top: "AttentionA_12/pool1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_12/pool1/scale"
  type: "Scale"
  bottom: "AttentionA_12/pool1/bn"
  top: "AttentionA_12/pool1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_12/pool1/relu"
	type: "ReLU"
	bottom: "AttentionA_12/pool1/bn"
	top: "AttentionA_12/pool1/bn"
}




layer{
	name: "AttentionA_12/pool1/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_12/pool1/bn"
	top: "AttentionA_12/pool1/conv1_1x1"
	convolution_param {
		num_output: 16
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
  name: "AttentionA_12_concat1"
  type: "Concat"
  bottom: "AttentionA_1/mask/down_sample/pool2/res2_1"
  bottom: "AttentionA_12/pool1/conv1_1x1"
  top: "AttentionA_12_concat1"
  concat_param {
    axis: 1
  }
}

###############################################################
#########################pan/AttentionA_2/mask/down_sample/pool2####################
layer{
	name: "AttentionA_2/mask/down_sample/pool2"
	type: "Pooling"
	bottom: "AttentionA_12_concat1"
	top: "AttentionA_2/mask/down_sample/pool2"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	name: "AttentionA_2/mask/down_sample/pool2/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/down_sample/pool2"
	top: "AttentionA_2/mask/down_sample/pool2/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/down_sample/pool2/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/down_sample/pool2/bn"
  top: "AttentionA_2/mask/down_sample/pool2/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/down_sample/pool2/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/down_sample/pool2/bn"
	top: "AttentionA_2/mask/down_sample/pool2/bn"
}

layer{
	name: "AttentionA_2/mask/down_sample/pool2/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_2/mask/down_sample/pool2/bn"
	top: "AttentionA_2/mask/down_sample/pool2/conv1_1x1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_2/mask/down_sample/pool2/conv1_1x1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/down_sample/pool2/conv1_1x1"
	top: "AttentionA_2/mask/down_sample/pool2/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/down_sample/pool2/conv1_1x1/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/down_sample/pool2/conv1_1x1/bn"
  top: "AttentionA_2/mask/down_sample/pool2/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/down_sample/pool2/conv1_1x1/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/down_sample/pool2/conv1_1x1/bn"
	top: "AttentionA_2/mask/down_sample/pool2/conv1_1x1/bn"
}

layer{
	name: "AttentionA_2/mask/down_sample/pool2/conv2_3x3"
	type: "Convolution"
	bottom: "AttentionA_2/mask/down_sample/pool2/conv1_1x1/bn"
	top: "AttentionA_2/mask/down_sample/pool2/conv2_3x3"
	convolution_param {
		num_output: 16
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_2/mask/down_sample/pool2/conv2_3x3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/down_sample/pool2/conv2_3x3"
	top: "AttentionA_2/mask/down_sample/pool2/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/down_sample/pool2/conv2_3x3/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/down_sample/pool2/conv2_3x3/bn"
  top: "AttentionA_2/mask/down_sample/pool2/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/down_sample/pool2/conv2_3x3/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/down_sample/pool2/conv2_3x3/bn"
	top: "AttentionA_2/mask/down_sample/pool2/conv2_3x3/bn"
}

layer{
	name: "AttentionA_2/mask/down_sample/pool2/conv3_1x1"
	type: "Convolution"
	bottom: "AttentionA_2/mask/down_sample/pool2/conv2_3x3/bn"
	top: "AttentionA_2/mask/down_sample/pool2/conv3_1x1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_2/mask/down_sample/pool2/res2_1"
	type: "Eltwise"
	bottom: "AttentionA_2/mask/down_sample/pool2/conv3_1x1"
	bottom: "AttentionA_2/mask/down_sample/pool2"
	top: "AttentionA_2/mask/down_sample/pool2/res2_1"
	eltwise_param {
		operation: SUM
	}
}


layer {
	name: "AttentionA_2/mask/down_sample/pool2/res2_1/add/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/down_sample/pool2/res2_1"
	top: "AttentionA_2/mask/down_sample/pool2/res2_1/add/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/down_sample/pool2/res2_1/add/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/down_sample/pool2/res2_1/add/bn"
  top: "AttentionA_2/mask/down_sample/pool2/res2_1/add/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/down_sample/pool2/res2_1/add/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/down_sample/pool2/res2_1/add/bn"
	top: "AttentionA_2/mask/down_sample/pool2/res2_1/add/bn"
}

layer{
	name: "AttentionA_2/mask/down_sample/pool2/res2_1/add/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_2/mask/down_sample/pool2/res2_1/add/bn"
	top: "AttentionA_2/mask/down_sample/pool2/res2_1/add/conv1_1x1"
	convolution_param {
		num_output: 16
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}


layer {
  name: "AttentionA_12_concat1"
  type: "Concat"
  bottom: "AttentionA_1/mask/down_sample/pool3/res3_1"
  bottom: "AttentionA_2/mask/down_sample/pool2/res2_1/add/conv1_1x1"
  top: "AttentionA_12_concat2"
  concat_param {
    axis: 1
  }
}

###########################pan/AttentionA_2/mask/down_sample/pool3#############
layer{
	name: "AttentionA_2/mask/down_sample/pool3"
	type: "Pooling"
	bottom: "AttentionA_12_concat2"
	top: "AttentionA_2/mask/down_sample/pool3"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	name: "AttentionA_2/mask/down_sample/pool3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/down_sample/pool3"
	top: "AttentionA_2/mask/down_sample/pool3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/down_sample/pool3/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/down_sample/pool3/bn"
  top: "AttentionA_2/mask/down_sample/pool3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/down_sample/pool3/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/down_sample/pool3/bn"
	top: "AttentionA_2/mask/down_sample/pool3/bn"
}

layer{
	name: "AttentionA_2/mask/down_sample/pool3/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_2/mask/down_sample/pool3/bn"
	top: "AttentionA_2/mask/down_sample/pool3/conv1_1x1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_2/mask/down_sample/pool3/conv1_1x1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/down_sample/pool3/conv1_1x1"
	top: "AttentionA_2/mask/down_sample/pool3/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/down_sample/pool3/conv1_1x1/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/down_sample/pool3/conv1_1x1/bn"
  top: "AttentionA_2/mask/down_sample/pool3/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/down_sample/pool3/conv1_1x1/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/down_sample/pool3/conv1_1x1/bn"
	top: "AttentionA_2/mask/down_sample/pool3/conv1_1x1/bn"
}

layer{
	name: "AttentionA_2/mask/down_sample/pool3/conv2_3x3"
	type: "Convolution"
	bottom: "AttentionA_2/mask/down_sample/pool3/conv1_1x1/bn"
	top: "AttentionA_2/mask/down_sample/pool3/conv2_3x3"
	convolution_param {
		num_output: 16
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_2/mask/down_sample/pool3/conv2_3x3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/down_sample/pool3/conv2_3x3"
	top: "AttentionA_2/mask/down_sample/pool3/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/down_sample/pool3/conv2_3x3/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/down_sample/pool3/conv2_3x3/bn"
  top: "AttentionA_2/mask/down_sample/pool3/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/down_sample/pool3/conv2_3x3/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/down_sample/pool3/conv2_3x3/bn"
	top: "AttentionA_2/mask/down_sample/pool3/conv2_3x3/bn"
}

layer{
	name: "AttentionA_2/mask/down_sample/pool3/conv3_1x1"
	type: "Convolution"
	bottom: "AttentionA_2/mask/down_sample/pool3/conv2_3x3/bn"
	top: "AttentionA_2/mask/down_sample/pool3/conv3_1x1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_2/mask/down_sample/pool3/res3_1"
	type: "Eltwise"
	bottom: "AttentionA_2/mask/down_sample/pool3/conv3_1x1"
	bottom: "AttentionA_2/mask/down_sample/pool3"
	top: "AttentionA_2/mask/down_sample/pool3/res3_1"
	eltwise_param {
		operation: SUM
	}
}

######################pan/AttentionA_2/mask/up_sample/interp2###########
layer{
	name: "AttentionA_2/mask/up_sample/interp2"
	type: "Interp"
	bottom: "AttentionA_2/mask/down_sample/pool3/res3_1"
	bottom: "AttentionA_12_concat2"
	top: "AttentionA_2/mask/up_sample/interp2"
}

layer{
	name: "AttentionA_2/mask/up_sample/in2"
	type: "Eltwise"
	bottom: "AttentionA_12_concat2"
	bottom: "AttentionA_2/mask/up_sample/interp2"
	top: "AttentionA_2/mask/up_sample/in2"
	eltwise_param {
		operation: SUM
	}
}

layer {
	name: "AttentionA_2/mask/up_sample/in2/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/up_sample/in2"
	top: "AttentionA_2/mask/up_sample/in2/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/up_sample/in2/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/up_sample/in2/bn"
  top: "AttentionA_2/mask/up_sample/in2/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/up_sample/in2/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/up_sample/in2/bn"
	top: "AttentionA_2/mask/up_sample/in2/bn"
}

layer{
	name: "AttentionA_2/mask/up_sample/in2/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_2/mask/up_sample/in2/bn"
	top: "AttentionA_2/mask/up_sample/in2/conv1_1x1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_2/mask/up_sample/in2/conv1_1x1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/up_sample/in2/conv1_1x1"
	top: "AttentionA_2/mask/up_sample/in2/conv1_1x1/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/up_sample/in2/conv1_1x1/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/up_sample/in2/conv1_1x1/bn"
  top: "AttentionA_2/mask/up_sample/in2/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/up_sample/in2/conv1_1x1/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/up_sample/in2/conv1_1x1/bn"
	top: "AttentionA_2/mask/up_sample/in2/conv1_1x1/bn"
}

layer{
	name: "AttentionA_2/mask/up_sample/in2/conv2_3x3"
	type: "Convolution"
	bottom: "AttentionA_2/mask/up_sample/in2/conv1_1x1/bn"
	top: "AttentionA_2/mask/up_sample/in2/conv2_3x3"
	convolution_param {
		num_output: 16
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_2/mask/up_sample/in2/conv2_3x3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/up_sample/in2/conv2_3x3"
	top: "AttentionA_2/mask/up_sample/in2/conv2_3x3/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/up_sample/in2/conv2_3x3/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/up_sample/in2/conv2_3x3/bn"
  top: "AttentionA_2/mask/up_sample/in2/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/up_sample/in2/conv2_3x3/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/up_sample/in2/conv2_3x3/bn"
	top: "AttentionA_2/mask/up_sample/in2/conv2_3x3/bn"
}

layer{
	name: "AttentionA_2/mask/up_sample/in2/conv3_1x1"
	type: "Convolution"
	bottom: "AttentionA_2/mask/up_sample/in2/conv2_3x3/bn"
	top: "AttentionA_2/mask/up_sample/in2/conv3_1x1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_2/mask/up_sample/in2/res2_1"
	type: "Eltwise"
	bottom: "AttentionA_2/mask/up_sample/in2/conv3_1x1"
	bottom: "AttentionA_2/mask/up_sample/in2"
	top: "AttentionA_2/mask/up_sample/in2/res2_1"
	eltwise_param {
		operation: SUM
	}
}

#############AttentionA_2/mask/up_sample/interp1###################

layer{
	name: "AttentionA_2/mask/up_sample/interp1"
	type: "Interp"
	bottom: "AttentionA_2/mask/up_sample/in2/res2_1"
	bottom: "AttentionA_12_concat1"
	top: "AttentionA_2/mask/up_sample/interp1"
}

layer {
	name: "AttentionA_2/mask/up_sample/interp1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/up_sample/interp1"
	top: "AttentionA_2/mask/up_sample/interp1/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/up_sample/interp1/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/up_sample/interp1/bn"
  top: "AttentionA_2/mask/up_sample/interp1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/up_sample/interp1/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/up_sample/interp1/bn"
	top: "AttentionA_2/mask/up_sample/interp1/bn"
}

layer{
	name: "AttentionA_2/mask/linear_1"
	type: "Convolution"
	bottom: "AttentionA_2/mask/up_sample/interp1/bn"
	top: "AttentionA_2/mask/linear_1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_2/mask/linear_1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2/mask/linear_1"
	top: "AttentionA_2/mask/linear_1/bn"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2/mask/linear_1/scale"
  type: "Scale"
  bottom: "AttentionA_2/mask/linear_1/bn"
  top: "AttentionA_2/mask/linear_1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2/mask/linear_1/relu"
	type: "ReLU"
	bottom: "AttentionA_2/mask/linear_1/bn"
	top: "AttentionA_2/mask/linear_1/bn"
}

layer{
	name: "AttentionA_2/mask/linear_2"
	type: "Convolution"
	bottom: "AttentionA_2/mask/linear_1/bn"
	top: "AttentionA_2/mask/linear_2"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_2/mask"
	type: "Sigmoid"
	bottom: "AttentionA_2/mask/linear_2"
	top: "AttentionA_2/mask"
}

layer{
	name: "AttentionA_2_prod"
	type: "Eltwise"
	bottom: "AttentionA_12_concat1"
	bottom: "AttentionA_2/mask"
	top: "AttentionA_2_prod"
	eltwise_param {
		operation: PROD
	}
}

layer{
	name: "AttentionA_2_sum"
	type: "Eltwise"
	bottom: "AttentionA_12_concat1"
	bottom: "AttentionA_2_prod"
	top: "AttentionA_2_sum"
	eltwise_param {
		operation: SUM
	}
}

layer {
	name: "AttentionA_2_sum/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2_sum"
	top: "AttentionA_2_sum/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2_sum/scale"
  type: "Scale"
  bottom: "AttentionA_2_sum/bn"
  top: "AttentionA_2_sum/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2_sum/relu"
	type: "ReLU"
	bottom: "AttentionA_2_sum/bn"
	top: "AttentionA_2_sum/bn"
}

layer{
	name: "AttentionA_2_sum/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_2_sum/bn"
	top: "AttentionA_2_sum/conv1_1x1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_2_sum/conv1_1x1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2_sum/conv1_1x1"
	top: "AttentionA_2_sum/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2_sum/conv1_1x1/scale"
  type: "Scale"
  bottom: "AttentionA_2_sum/conv1_1x1/bn"
  top: "AttentionA_2_sum/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2_sum/conv1_1x1/relu"
	type: "ReLU"
	bottom: "AttentionA_2_sum/conv1_1x1/bn"
	top: "AttentionA_2_sum/conv1_1x1/bn"
}

layer{
	name: "AttentionA_2_sum/conv2_3x3"
	type: "Convolution"
	bottom: "AttentionA_2_sum/conv1_1x1/bn"
	top: "AttentionA_2_sum/conv2_3x3"
	convolution_param {
		num_output: 16
		pad: 1
		kernel_size: 3
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
	name: "AttentionA_2_sum/conv2_3x3/bn"
	type: "BatchNorm"
	bottom: "AttentionA_2_sum/conv2_3x3"
	top: "AttentionA_2_sum/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_2_sum/conv2_3x3/scale"
  type: "Scale"
  bottom: "AttentionA_2_sum/conv2_3x3/bn"
  top: "AttentionA_2_sum/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_2_sum/conv2_3x3/relu"
	type: "ReLU"
	bottom: "AttentionA_2_sum/conv2_3x3/bn"
	top: "AttentionA_2_sum/conv2_3x3/bn"
}

layer{
	name: "AttentionA_2_sum/conv3_1x1"
	type: "Convolution"
	bottom: "AttentionA_2_sum/conv2_3x3/bn"
	top: "AttentionA_2_sum/conv3_1x1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer{
	name: "AttentionA_2_sum/res3_1"
	type: "Eltwise"
	bottom: "AttentionA_2_sum/conv3_1x1"
	bottom: "AttentionA_2_sum"
	top: "AttentionA_2_sum/res3_1"
	eltwise_param {
		operation: SUM
	}
}

################################pan/AttentionA_23####################
layer{
	name: "AttentionA_23/pool1"
	type: "Pooling"
	bottom: "AttentionA_2_sum/res3_1"
	top: "AttentionA_23/pool1"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	name: "AttentionA_23/pool1/bn"
	type: "BatchNorm"
	bottom: "AttentionA_23/pool1"
	top: "AttentionA_23/pool1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_23/pool1/scale"
  type: "Scale"
  bottom: "AttentionA_23/pool1/bn"
  top: "AttentionA_23/pool1/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_23/pool1/relu"
	type: "ReLU"
	bottom: "AttentionA_23/pool1/bn"
	top: "AttentionA_23/pool1/bn"
}

layer{
	name: "AttentionA_23/pool1/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_23/pool1/bn"
	top: "AttentionA_23/pool1/conv1_1x1"
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		bias_term: false
                weight_filler {
                   type: "msra"
                }
	}
}

layer {
  name: "AttentionA_23_concat1"
  type: "Concat"
  bottom: "AttentionA_12_concat2"
  bottom: "AttentionA_23/pool1/conv1_1x1"
  top: "AttentionA_23_concat1"
  concat_param {
    axis: 1
  }
}

###############################################################
#########################pan/AttentionA_3/mask/down_sample/pool2####################
layer{
	name: "AttentionA_3/mask/down_sample/pool2"
	type: "Pooling"
	bottom: "AttentionA_23_concat1"
	top: "AttentionA_3/mask/down_sample/pool2"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	name: "AttentionA_3/mask/down_sample/pool2/bn"
	type: "BatchNorm"
	bottom: "AttentionA_3/mask/down_sample/pool2"
	top: "AttentionA_3/mask/down_sample/pool2/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    eps: 1e-4
  }
}
layer {
  name: "AttentionA_3/mask/down_sample/pool2/scale"
  type: "Scale"
  bottom: "AttentionA_3/mask/down_sample/pool2/bn"
  top: "AttentionA_3/mask/down_sample/pool2/bn"
  scale_param {
    bias_term: true
  }
}

layer{
	name: "AttentionA_3/mask/down_sample/pool2/relu"
	type: "ReLU"
	bottom: "AttentionA_3/mask/down_sample/pool2/bn"
	top: "AttentionA_3/mask/down_sample/pool2/bn"
}

layer{
	name: "AttentionA_3/mask/down_sample/pool2/conv1_1x1"
	type: "Convolution"
	bottom: "AttentionA_3/mask/down_sample/pool2/bn"
	top: "AttentionA_3/mask/down_sample/pool2/conv1_1x1"
	convolution_param {
		num_output: 64
		pad: 0
